[{"date":"20230319","opponent":"aditya_1999","rating":761,"oppRating":770,"whiteOrBlack":"black","winLossDraw":"loss","opening":"sicilian","accuracy":60.2,"oppAccuracy":67.6,"easilyPreventableLoss":true,"gotLucky":false,"numTurns":32,"numBlunders":5,"timeControl":"rapid30","remarks":"prevantable blunders cost me the game!","moveList":"\"1. e4 c5 2. Nf3 Nc6 3. Nc3 Nf6 4. Bc4 e6 5. d3 d5 6. exd5 exd5 7. Bb5 Qd7 8. Ne5Qe6 9. d4 a6 10. Bxc6+ bxc6 11. O-O cxd4 12. Qxd4 c5 13. Qf4 Nh5 14. Qd2 d4 15.Ne4 Qxe5 16. Re1 Bb7 17. Nxc5 Be4 18. Rxe4 Bd6 19. Rxe5+ Bxe5 20. Qe1 f6 21. Bf4Nxf4 22. Qe4 O-O 23. Ne6 Nxe6 24. Qd5 Kf7 25. Qd7+ Kg8 26. Qxe6+ Rf7 27. c3 dxc328. bxc3 Bxc3 29. Rc1 Re8 30. Qxe8+ Rf8 31. Qe6+ Kh8 32. Rxc3 1-0\""},{"date":"20230320","opponent":"sharptail72","rating":754,"oppRating":762,"whiteOrBlack":"white","winLossDraw":"win","opening":"pirc defense","accuracy":60,"oppAccuracy":58.8,"easilyPreventableLoss":false,"gotLucky":true,"numTurns":18,"numBlunders":0,"timeControl":"rapid30","remarks":"was going for some kind of king's gambit; sacrificed knight to force enemy king out of position; opponent resigned after hanging a queen -- lucky win","moveList":"\"1. e4 d6 2. f4 e6 3. Nf3 Nf6 4. Nc3 g6 5. e5 dxe5 6. Nxe5 Qe7 7. Bc4 Qc5 8. Na4Qd6 9. Nxf7 Kxf7 10. d3 Qb4+ 11. Nc3 Qb6 12. Qf3 Bc5 13. Na4 Qb4+ 14. Nc3 Nc615. a3 Qb6 16. Na4 Nd4 17. Qd1 Bd7 18. Nxb6 1-0\""},{"date":"20230320","opponent":"hghsyjsneknfnnf","rating":772,"oppRating":770,"whiteOrBlack":"black","winLossDraw":"win","opening":"sicilian","accuracy":95.8,"oppAccuracy":65.3,"easilyPreventableLoss":false,"gotLucky":false,"numTurns":12,"numBlunders":0,"timeControl":"rapid30","remarks":"one of my strongest and most accurate games yet in general; opponent spent a lot of time making questionable queen moves, and as a result I won","moveList":"\"1. e4 c5 2. Bc4 e6 3. d4 d5 4. exd5 exd5 5. Qe2+ Be7 6. Bg5 dxc4 7. Qe5 f6 8.Bxf6 Nxf6 9. Qg5 g6 10. Qh6 Qxd4 11. Qg7 Rg8 12. c3 Qe4+ 0-1\""},{"date":"20230320","opponent":"roman1tal","rating":772,"oppRating":701,"whiteOrBlack":"white","winLossDraw":"win","opening":"damiano defense","accuracy":75.6,"oppAccuracy":71,"easilyPreventableLoss":false,"gotLucky":true,"numTurns":25,"numBlunders":1,"timeControl":"rapid30","remarks":"I got lucky when he failed to take two hanging pieces, and then I took advantage of a few questionable moves to win the game -- could have gone either way! An early queen trade (forcing his king to take and no longer be able to castle) set the stage for a positional game. He resigned after I took a hanging bishop, but had he taken either of the pieces I had left hanging I would have lost.","moveList":"\"1. e4 e5 2. Nf3 f6 3. d4 d6 4. dxe5 dxe5 5. Qxd8+ Kxd8 6. Bc4 Ne7 7. O-O g5 8.Rd1+ Nd7 9. Nc3 c6 10. a4 a5 11. Be3 Kc7 12. Rab1 h5 13. b4 Ng6 14. bxa5 Rxa515. Bb6+ Kb8 16. Bxa5 g4 17. Ne1 h4 18. Nd3 h3 19. g3 f5 20. exf5 e4 21. Nxe4Nge5 22. Nxe5 Nxe5 23. Rd8 Nf3+ 24. Kh1 Rh6 25. Rxf8 1-0\""},{"date":"20230320","opponent":"shizznitz","rating":779,"oppRating":701,"whiteOrBlack":"black","winLossDraw":"draw","opening":"richter-veresov attack","accuracy":67.1,"oppAccuracy":64.4,"easilyPreventableLoss":false,"gotLucky":true,"numTurns":36,"numBlunders":2,"timeControl":"rapid30","remarks":"a couple of hung pawns and a questionable bishop sacrifice almost cost me the game; managed to make a draw out of it with careful play; this was a case of getting lucky in the midgame, as if my opponent had not made two blunders I wouldn't have been able to secure a draw by agreement.","moveList":"\"1. d4 d5 2. Bg5 Nf6 3. Nc3 Qd7 4. e3 g6 5. Qe2 a6 6. e4 Nxe4 7. Nxe4 dxe4 8.Qxe4 Qf5 9. Qxf5 Bxf5 10. c3 b5 11. Bf4 c6 12. Rd1 Bg7 13. d5 c5 14. d6 exd6 15.Bxd6 Nc6 16. Nf3 Bf6 17. Bxc5 Rd8 18. Rc1 a5 19. Bxb5 Bd7 20. O-O Ne5 21. Bxd7+Rxd7 22. Nd4 Nd3 23. Rc2 Nxc5 24. Re1+ Re7 25. Rce2 Nd3 26. Rxe7+ Bxe7 27. Re2O-O 28. Rxe7 Nxb2 29. Nc6 a4 30. Na5 Rd8 31. g3 Rc8 32. Nb7 Rxc3 33. Nd8 Rf3 34.Re8+ Kg7 35. Kg2 Rf6 36. f4 Nc4 1/2-1/2\""},{"date":"20230321","opponent":"Timababa","rating":777,"oppRating":807,"whiteOrBlack":"black","winLossDraw":"loss","opening":"sicilian","accuracy":57,"oppAccuracy":74.3,"easilyPreventableLoss":false,"gotLucky":false,"numTurns":24,"numBlunders":1,"timeControl":"rapid30","remarks":"a tough game where my opponent played very well. one worth studying. Blundered into a checkmate at the end, but they probably would have won even if I hadn't. Pretty good game! This is probably one where knowing more about the opening would have allowed me to fare better.","moveList":"\"1. e4 c5 2. Nc3 e6 3. Nf3 d5 4. exd5 exd5 5. d4 Nf6 6. Bb5+ Bd7 7. Be3 c4 8. Qd2a6 9. Bxd7+ Qxd7 10. O-O-O Bd6 11. Ne5 Qe6 12. Rhe1 O-O 13. Bf4 b5 14. Ng6 Ne415. Nxe4 Qxg6 16. Nxd6 Qxg2 17. Bg5 Qxh2 18. Be7 Re8 19. Qe2 Nc6 20. Qf3 Nxe721. Qxf7+ Kh8 22. Nxe8 Qh6+ 23. f4 Ng8 24. Kb1 Qc6 1-0\""},{"date":"20230321","opponent":"dsuit94","rating":770,"oppRating":901,"whiteOrBlack":"black","winLossDraw":"win","opening":"italian game","accuracy":74.6,"oppAccuracy":71.4,"easilyPreventableLoss":false,"gotLucky":false,"numTurns":54,"numBlunders":1,"timeControl":"rapid30","remarks":"a tough game. I'm still not sure why I do so well with the italian game when playing black, but I'll take it! A crucial rook sacrifice gave me the chance to checkmate, and since the opponent was playing well it took a little while to get. Good win! This game featured a rare kingside castle in the midgame after the f-pawn had been removed from the file, so it had a king's gambit flavor to it sort of.","moveList":"\"1. e4 e5 2. Nf3 Nc6 3. Bc4 d6 4. d4 f5 5. Bg5 Be7 6. Bxe7 Ngxe7 7. Bb5 Bd7 8. d5a6 9. dxc6 Nxc6 10. Bxc6 bxc6 11. c4 fxe4 12. Nfd2 O-O 13. Nxe4 Rb8 14. b3 Bf515. Qd3 d5 16. cxd5 cxd5 17. Qxa6 Bxe4 18. Qe6+ Kh8 19. O-O Qg5 20. f3 Qe3+ 21.Kh1 Bd3 22. Rd1 Rxf3 23. gxf3 Qxf3+ 24. Kg1 Qxd1+ 25. Kg2 Qf1+ 26. Kg3 Qg1+ 27.Kh3 Qe3+ 28. Kg2 Qe4+ 29. Kh3 Bf1+ 30. Kg3 Qg2+ 31. Kh4 Rb4+ 32. Kh5 Be2+ 33.Qg4 Bxg4+ 34. Kg5 Be2+ 35. Kf5 Qe4+ 36. Ke6 Rb6+ 37. Kd7 Qf5+ 38. Kxc7 Qf6 39.Nc3 Qc6+ 40. Kd8 Rb8+ 41. Ke7 Qe8+ 42. Kd6 Qd8+ 43. Kxe5 Bf3 44. Rd1 Qg5+ 45.Kd4 Rb4+ 46. Kc5 Rf4 47. Rxd5 Qe7+ 48. Kc6 Bxd5+ 49. Nxd5 Qe8+ 50. Kc5 Rf5 51.b4 Qd8 52. b5 Qxd5+ 53. Kb4 Qc5+ 54. Ka5 Qxb5# 0-1\""},{"date":"20230321","opponent":"emanuelionescu","rating":781,"oppRating":761,"whiteOrBlack":"white","winLossDraw":"win","opening":"scandinavian defense","accuracy":75,"oppAccuracy":43.1,"easilyPreventableLoss":false,"gotLucky":false,"numTurns":7,"numBlunders":1,"timeControl":"rapid30","remarks":"opponent played the scandiavian defense and it cost them the game. They resigned after a series of forced queen moves left a knight fork of the king and rook open. The chess.com analysis says I made a blunder here by not going for a queen trade, but I didn't consider it one and I won the game. At a higher level the trade would have probably been a stronger move.","moveList":"\"1. e4 d5 2. exd5 Qxd5 3. Nc3 Qd4 4. Nf3 Bg4 5. Be2 Qd6 6. Nb5 Qg6 7. Nxc7+ 1-0\""},{"date":"20230321","opponent":"Lafarce78","rating":789,"oppRating":825,"whiteOrBlack":"white","winLossDraw":"win","opening":"ponziani opening","accuracy":88.4,"oppAccuracy":68.6,"easilyPreventableLoss":false,"gotLucky":false,"numTurns":15,"numBlunders":0,"timeControl":"rapid30","remarks":"an early attack on the center worked out. took advantage of pins and tempo-gaining attacks on the queen to win. opponent resigned after I pinned their queen.","moveList":"\"1. e4 e5 2. Nf3 Nc6 3. c3 Bc5 4. d4 exd4 5. cxd4 Bb4+ 6. Nc3 Bxc3+ 7. bxc3 d5 8.e5 Bg4 9. Be2 f6 10. O-O Qe7 11. Qa4 Bxf3 12. Bxf3 O-O-O 13. Ba3 Qe6 14. Qd1fxe5 15. Bg4 1-0\""},{"date":"20230322","opponent":"afdghhudcvb","rating":798,"oppRating":800,"whiteOrBlack":"white","winLossDraw":"win","opening":"king's pawn","accuracy":82.8,"oppAccuracy":67.3,"easilyPreventableLoss":false,"gotLucky":true,"numTurns":18,"numBlunders":0,"timeControl":"rapid30","remarks":"baited opponent into hanging their queen early, and then later baited them into a queen fork of both rooks, after which they blundered into a checkmate -- got lucky!","moveList":"1. e4 e5 2. Nf3 Qf6 3. d4 exd4 4. Nxd4 Bc5 5. Nf5 Nh6 6. Qf3 d5 7. Nxh6 Qxh6 8.Bxh6 gxh6 9. exd5 c6 10. dxc6 Nxc6 11. Bb5 Bd7 12. Qe2+ Kf8 13. O-O Re8 14. Qh5Re5 15. Qxh6+ Ke8 16. Bxc6 bxc6 17. Qf6 Re7 18. Qxh8# 1-0"},{"date":"20230322","opponent":"Landofthenew","rating":806,"oppRating":830,"whiteOrBlack":"black","winLossDraw":"win","opening":"sicilian","accuracy":78.7,"oppAccuracy":76.5,"easilyPreventableLoss":false,"gotLucky":true,"numTurns":51,"numBlunders":1,"timeControl":"rapid30","remarks":"a good game -- almost had a chance for an early checkmate, but opponent made the correct move to block it. Instead, a timely queen trade and knight sacrifice opened up the position of their castled king, allowing me to apply pressure for the rest of the game, resulting in an eventual win in the endgame when the opponent resigned after losing all their pieces. At a key point in the endgame, the opponent missed a mate-in-3, and moved their rook to an unwise position, allowing me to win the endgame with careful play. Of note is that the analysis engine suggests my queen trade to ruin the king's castle was not a winning move, so it can be assumed that with better play my opponent might have won from there. In the future, it would be a good idea to make sure the queen can't interfere with that attack before it commences.","moveList":"1. e4 c5 2. Nf3 Nc6 3. d4 e6 4. e5 d5 5. Bb5 Qb6 6. a4 cxd4 7. O-O Bd7 8. Bxc6Bxc6 9. Nxd4 Bc5 10. Nxc6 Qxc6 11. Nc3 Ne7 12. a5 d4 13. Ne2 Nf5 14. c3 dxc3 15.Nxc3 Nh4 16. Qg4 Qxg2+ 17. Qxg2 Nxg2 18. Kxg2 O-O 19. Be3 Bxe3 20. fxe3 Rfd8 21.Rad1 a6 22. Rxd8+ Rxd8 23. Rd1 Rc8 24. Rd7 Rb8 25. b4 f5 26. e4 f4 27. Kf3 g528. Re7 Rc8 29. Na4 Rc2 30. Nc5 Rxh2 31. Nxe6 Rh3+ 32. Kg4 Rg3+ 33. Kf5 f3 34.Rg7+ Kh8 35. Rxg5 Rxg5+ 36. Nxg5 f2 37. Nf7+ Kg7 38. e6 f1=Q+ 39. Ke5 Qf6+ 40.Kd6 Kf8 41. e5 Qe7+ 42. Kd5 Qxb4 43. Nd6 Qxa5+ 44. Ke4 Ke7 45. Nf5+ Kxe6 46.Ng7+ Ke7 47. Nf5+ Kf7 48. Nd6+ Ke6 49. Nxb7 Qxe5+ 50. Kd3 Qd5+ 51. Ke3 Qxb7 0-1"},{"date":"20230322","opponent":"SpecifiedSpoons","rating":815,"oppRating":796,"whiteOrBlack":"black","winLossDraw":"loss","opening":"queen's pawn","accuracy":57.8,"oppAccuracy":80.2,"easilyPreventableLoss":true,"gotLucky":false,"numTurns":18,"numBlunders":1,"timeControl":"rapid30","remarks":"blunder cost me the game!","moveList":"1. d4 d5 2. Nc3 e6 3. Nf3 Bb4 4. Bd2 Nc6 5. e4 Bd7 6. exd5 exd5 7. Nxd5 Bg4 8.Nxb4 Nf6 9. Nxc6 bxc6 10. Be2 O-O 11. Ne5 Bxe2 12. Qxe2 Qxd4 13. Nxc6 Qxb2 14.Qd1 Rfe8+ 15. Be3 Rad8 16. Nxd8 Rxd8 17. Qxd8+ Ne8 18. Qxe8# 1-0"},{"date":"20230322","opponent":"petermuehl","rating":806,"oppRating":721,"whiteOrBlack":"white","winLossDraw":"loss","opening":"sicilian","accuracy":73.5,"oppAccuracy":67.1,"easilyPreventableLoss":true,"gotLucky":false,"numTurns":27,"numBlunders":2,"timeControl":"rapid30","remarks":"tough game -- had a couple chances to win, but it didn't go my way","moveList":"1. e4 c5 2. Nf3 Nf6 3. e5 Nd5 4. Bc4 e6 5. d4 Be7 6. Bg5 O-O 7. Bxe7 Nxe7 8.dxc5 Qa5+ 9. Nc3 d5 10. Be2 Qxc5 11. O-O Nd7 12. Qd2 Qc7 13. Nd4 Nxe5 14. Ndb5Qd8 15. a4 a6 16. Nd4 N7g6 17. Nd1 Nh4 18. Ne3 Qg5 19. Nf3 Nexf3+ 20. Bxf3 Nxf3+21. Kh1 Nxd2 22. Rg1 d4 23. Nd1 Ne4 24. c3 Qg4 25. cxd4 Rd8 26. f3 Ng3+ 27. hxg3Qh5# 0-1"},{"date":"20230322","opponent":"youchoose929","rating":796,"oppRating":896,"whiteOrBlack":"white","winLossDraw":"loss","opening":"queen's pawn","accuracy":77.4,"oppAccuracy":80.3,"easilyPreventableLoss":false,"gotLucky":false,"numTurns":65,"numBlunders":2,"timeControl":"rapid30","remarks":"a tough game! opponent was solid in the endgame","moveList":"1. Nf3 d5 2. d4 e6 3. e3 c5 4. Bd3 cxd4 5. exd4 Bb4+ 6. Nbd2 Bxd2+ 7. Bxd2 Nc68. a3 Nf6 9. Bg5 h6 10. Bh4 g5 11. Bg3 Nh5 12. Be5 Nxe5 13. Nxe5 Nf4 14. O-ONxd3 15. Qxd3 f6 16. Qg6+ Ke7 17. Nf7 Qe8 18. Rfe1 Qxf7 19. Qxf7+ Kxf7 20. Rac1Bd7 21. c3 Rae8 22. c4 dxc4 23. Rxc4 e5 24. Rc7 exd4 25. Rxe8 Rxe8 26. Rxd7+ Re727. Rxe7+ Kxe7 28. Kf1 Kd6 29. Ke2 Kd5 30. Kd3 b5 31. b3 a5 32. g3 f5 33. f3 h534. h3 g4 35. hxg4 f4 36. Ke2 fxg3 37. Kf1 g2+ 38. Kxg2 d3 39. Kf2 d2 40. Ke2 h441. Kxd2 h3 42. Ke2 h2 43. Ke3 h1=Q 44. Kf4 Qc1+ 45. Kg3 Qxa3 46. g5 Qd6+ 47.Kg4 Qe6+ 48. Kh5 Qf7+ 49. g6 Qxf3+ 50. Kh6 a4 51. bxa4 bxa4 52. g7 Qf4+ 53. Kh7Qg3 54. Kh8 a3 55. g8=Q+ Qxg8+ 56. Kxg8 a2 57. Kh8 a1=Q+ 58. Kh7 Qf6 59. Kg8 Ke660. Kh7 Ke7 61. Kg8 Qf7+ 62. Kh8 Qf1 63. Kg7 Qg1+ 64. Kh8 Kf7 65. Kh7 Qh1# 0-1"},{"date":"20230322","opponent":"AyeV4n","rating":796,"oppRating":791,"whiteOrBlack":"black","winLossDraw":"loss","opening":"sicilian","accuracy":64.1,"oppAccuracy":74.3,"easilyPreventableLoss":true,"gotLucky":false,"numTurns":26,"numBlunders":1,"timeControl":"rapid30","remarks":"tough game where my opponent played well. sicilian didn't work out for me this time. Resigned after hanging a rook in a losing endgame.","moveList":"1. e4 c5 2. Qf3 Nc6 3. Nc3 Ne5 4. Qe3 Nf6 5. Qxc5 d6 6. Qb5+ Qd7 7. Nge2 a6 8.Qxd7+ Nexd7 9. d4 e5 10. Be3 Be7 11. O-O-O Ng4 12. dxe5 Ndxe5 13. Nd5 Nxe3 14.fxe3 Ng4 15. Nc7+ Kd7 16. Nxa8 Nf2 17. Rg1 Nxd1 18. Kxd1 Bd8 19. Nd4 Re8 20. Bc4b5 21. Bd5 f6 22. Be6+ Ke7 23. Bxc8 Ba5 24. Nc6+ Kf7 25. Nxa5 Rxc8 26. Nb6 Ke61-0"},{"date":"20230323","opponent":"Jumping_parkour_Pa","rating":782,"oppRating":750,"whiteOrBlack":"white","winLossDraw":"loss","opening":"ruy lopez","accuracy":54.1,"oppAccuracy":60.9,"easilyPreventableLoss":true,"gotLucky":false,"numTurns":32,"numBlunders":2,"timeControl":"rapid30","remarks":"opponent played well. hung my queen at a crucial moment, or else I might have stood a chance in the endgame","moveList":"1. e4 e5 2. Nf3 Nc6 3. Bb5 d6 4. d4 Bd7 5. Bg5 f6 6. Be3 a6 7. Bd3 Nge7 8. dxe5fxe5 9. c3 Bg4 10. Nbd2 Qd7 11. Be2 g6 12. O-O O-O-O 13. Nc4 Bg7 14. Ng5 Bxe215. Qxe2 Ng8 16. Rad1 Nf6 17. b4 h6 18. Nf3 Ne7 19. Nfxe5 Qe6 20. Nxd6+ Rxd6 21.Rxd6 Qxd6 22. Nf7 Qc6 23. Nxh8 Bxh8 24. Bd4 g5 25. e5 Nf5 26. Qg4 Nxg4 27. Re1Nh4 28. f3 Nxf3+ 29. gxf3 Qxf3 30. e6 Bxd4+ 31. Re3 Qf2+ 32. Kh1 Qxh2# 0-1"},{"date":"20230323","opponent":"Kiitann","rating":773,"oppRating":630,"whiteOrBlack":"black","winLossDraw":"win","opening":"queen's pawn","accuracy":61.7,"oppAccuracy":56,"easilyPreventableLoss":false,"gotLucky":true,"numTurns":42,"numBlunders":2,"timeControl":"rapid30","remarks":"opponent played a positional game, and I managed to win through slow attrition and a few critical mistakes made by the opposing player; they had a chance to checkmate towards the end, and blundered it, followed by hanging their queen -- could have gone either way!","moveList":"1. d4 d5 2. Nc3 Nf6 3. f4 Bf5 4. e3 Qd7 5. g3 Ne4 6. Nb5 Nd6 7. a4 Nxb5 8. axb5Be4 9. Nf3 e6 10. h4 Qd6 11. Rg1 Qb4+ 12. c3 Qd6 13. Ng5 Nd7 14. Qh5 Qe7 15. Ra4g6 16. Qg4 f5 17. Qh3 Nb6 18. Rb4 h6 19. Nxe4 fxe4 20. h5 Qf7 21. g4 Bxb4 22.cxb4 O-O-O 23. Be2 Rdg8 24. Rg2 Nd7 25. g5 hxg5 26. Rxg5 Nf6 27. h6 Nh7 28. Re5Nf8 29. Bg4 Kd7 30. f5 exf5 31. Be2 Ne6 32. Rxd5+ Kc8 33. b6 Nf4 34. Rd7 Qxd735. exf4 Qxd4 36. b5 Qxb6 37. Bd2 Re8 38. Qc3 e3 39. Bc1 Rxh6 40. Bxe3 Rxe3 41.Kd1 Rxc3 42. bxc3 0-1"},{"date":"20230323","opponent":"MaddenJoe007","rating":778,"oppRating":795,"whiteOrBlack":"black","winLossDraw":"win","opening":"king's pawn","accuracy":86.4,"oppAccuracy":65.1,"easilyPreventableLoss":false,"gotLucky":true,"numTurns":23,"numBlunders":0,"timeControl":"rapid30","remarks":"my opponent left some pieces hanging after an early attack went awry; got lucky and managed to checkmate-in-3. I often do well in king's pawn games with black, for some reason.","moveList":"1. e4 e5 2. Qh5 Nc6 3. Bc4 Nh6 4. Qf3 Na5 5. Bd5 c6 6. Bb3 Nxb3 7. axb3 d5 8.Ra4 b5 9. Ra6 Bxa6 10. d3 Be7 11. exd5 cxd5 12. Bf4 exf4 13. Qxf4 O-O 14. Nc3Bb4 15. Qxb4 Re8+ 16. Nge2 Qe7 17. O-O Qxb4 18. Nxd5 Qd2 19. Nc7 Rxe2 20. Nxa8Rxf2 21. h3 Rxg2+ 22. Kh1 Rh2+ 23. Kg1 Qg2# 0-1"},{"date":"20230323","opponent":"JXTSTNNNNNNNNNNNNN","rating":786,"oppRating":775,"whiteOrBlack":"white","winLossDraw":"win","opening":"queen's pawn","accuracy":61.4,"oppAccuracy":57.8,"easilyPreventableLoss":false,"gotLucky":false,"numTurns":42,"numBlunders":3,"timeControl":"rapid30","remarks":"took advantage of some hung pieces to win the game; opponent resigned in the endgame when I had a strong position.","moveList":"1. Nf3 d5 2. Nc3 Nf6 3. d4 Nc6 4. Bf4 e5 5. Nxe5 Nxe5 6. dxe5 Nh5 7. Be3 f6 8.exf6 Nxf6 9. Bg5 h6 10. Bh4 g5 11. Bg3 d4 12. Nb5 Bg7 13. Nxd4 Ne4 14. c3 Nxg315. hxg3 c5 16. Nf3 Qxd1+ 17. Rxd1 Bg4 18. e4 O-O 19. Bc4+ Kh7 20. O-O Rfe8 21.Bd5 Rad8 22. c4 Bxf3 23. gxf3 Bxb2 24. Bxb7 Rxd1 25. Rxd1 Rb8 26. Rd7+ Kg8 27.Bd5+ Kf8 28. Rxa7 h5 29. Rh7 Bd4 30. Rxh5 Rb1+ 31. Kg2 Rb2 32. a4 Rxf2+ 33. Kh3Rxf3 34. Rxg5 Ra3 35. e5 Rxa4 36. Rg8+ Ke7 37. e6 Kf6 38. Kh4 Ra2 39. Kg4 Be540. Rg5 Rg2 41. Rf5+ Ke7 42. Rxe5 Rd2 1-0"},{"date":"20230324","opponent":"NCEVE","rating":794,"oppRating":829,"whiteOrBlack":"black","winLossDraw":"loss","opening":"italian game","accuracy":78.7,"oppAccuracy":84.7,"easilyPreventableLoss":false,"gotLucky":false,"numTurns":74,"numBlunders":2,"timeControl":"rapid30","remarks":"tough game! opponent played well, and beat me with better endgame play","moveList":"1. e4 e5 2. Nf3 Nc6 3. Bc4 Nh6 4. O-O d6 5. d3 Nd4 6. Bg5 Be7 7. Bxe7 Qxe7 8.Nxd4 exd4 9. c3 Bg4 10. Qa4+ Bd7 11. Qb3 b6 12. cxd4 b5 13. Bxb5 Bxb5 14. Qxb5+Qd7 15. Qxd7+ Kxd7 16. Re1 Rab8 17. b3 Rb4 18. d5 Re8 19. Nc3 Ng4 20. f3 Ne5 21.Reb1 Nxd3 22. a3 Rd4 23. Nb5 Rdxe4 24. fxe4 Rxe4 25. Nxa7 f5 26. Rd1 Nf4 27.Rdc1 Ne2+ 28. Kf1 Nxc1 29. Rxc1 Re3 30. Rb1 Rd3 31. Ke2 Rxd5 32. b4 Re5+ 33. Kf2d5 34. b5 d4 35. b6 cxb6 36. Rxb6 d3 37. Rb7+ Ke6 38. Rb2 Ra5 39. Rb6+ Kd5 40.Rb5+ Rxb5 41. Nxb5 Kc4 42. Nd6+ Kc3 43. Nxf5 d2 44. Ne3 Kb3 45. Ke2 Kxa3 46.Kxd2 Kb4 47. Nf5 g6 48. Ne3 Kc5 49. Ke2 Kd4 50. g4 h6 51. h3 Ke4 52. Kf2 Kf4 53.Nd5+ Ke5 54. Ne3 Kf4 55. h4 Ke5 56. Kf3 Kd4 57. Kf4 g5+ 58. hxg5 hxg5+ 59. Kxg5Kxe3 60. Kf5 Kd4 61. g5 Kd5 62. Kf6 Kd6 63. g6 Kd7 64. Kf7 Kd8 65. g7 Kd7 66.g8=Q Kc7 67. Qg7 Kd7 68. Kf6+ Kd6 69. Qe7+ Kc6 70. Ke6 Kb6 71. Kd6 Ka6 72. Kc6Ka5 73. Qc5+ Ka6 74. Qb6# 1-0"},{"date":"20230324","opponent":"zahardyadchenko","rating":787,"oppRating":913,"whiteOrBlack":"white","winLossDraw":"loss","opening":"king's pawn","accuracy":57.9,"oppAccuracy":66.4,"easilyPreventableLoss":false,"gotLucky":false,"numTurns":47,"numBlunders":2,"timeControl":"rapid30","remarks":"tough game! opponent played well in the mid and end-games, foiling my attacks for an eventual checkmate","moveList":"1. e4 e5 2. Nf3 Bc5 3. Nxe5 Qh4 4. Nd3 Qxe4+ 5. Qe2 d5 6. Nxc5 Qxe2+ 7. Bxe2 b68. Bb5+ c6 9. Bxc6+ Nxc6 10. Nd3 Nd4 11. Nb4 Be6 12. c3 Nb5 13. d4 Kd7 14. Bf4a5 15. Nd3 f6 16. a4 Na7 17. O-O Bf5 18. Ne5+ fxe5 19. Bxe5 Nf6 20. Nd2 Ne4 21.Nxe4 Bxe4 22. Bxg7 Rhg8 23. f3 Bd3 24. Rfd1 Bc2 25. Rdc1 Bb3 26. Be5 h5 27. Ra3Bc4 28. b3 Bd3 29. Rd1 Bf5 30. Rc1 Bh3 31. g3 h4 32. g4 Raf8 33. Kf2 Bxg4 34.Ke3 Rxf3+ 35. Kd2 Rf2+ 36. Kd3 h3 37. c4 Rf3+ 38. Kc2 dxc4 39. d5 cxb3+ 40. Rxb3Bf5+ 41. Kb2 Rf2+ 42. Rc2 Bxc2 43. Rxh3 Bf5+ 44. Kc3 Bxh3 45. Bd4 Rf3+ 46. Kc4Nc8 47. Kb5 Bf1# 0-1"},{"date":"20230324","opponent":"miraltii","rating":782,"oppRating":731,"whiteOrBlack":"white","winLossDraw":"win","opening":"queen's pawn","accuracy":93.9,"oppAccuracy":64.7,"easilyPreventableLoss":false,"gotLucky":false,"numTurns":8,"numBlunders":0,"timeControl":"rapid30","remarks":"a baited knight exchange allowed me to fork the king and rook with my bishop, and following that the opponent resigned. strong opening play on my part.","moveList":"1. d4 d5 2. Nf3 f5 3. e3 e6 4. Ne5 Nc6 5. Bb5 Nf6 6. Nxc6 bxc6 7. Bxc6+ Kf7 8.Bxa8 1-0"},{"date":"20230324","opponent":"thecheesehead01","rating":789,"oppRating":773,"whiteOrBlack":"black","winLossDraw":"loss","opening":"italian game","accuracy":55.6,"oppAccuracy":70.4,"easilyPreventableLoss":true,"gotLucky":false,"numTurns":22,"numBlunders":3,"timeControl":"rapid15|10","remarks":"mistake in the opening followed by a preventable checkmate -- rough loss, but could have been avoided","moveList":"1. e4 e5 2. Nf3 Nc6 3. Bc4 Qe7 4. b3 d6 5. Bb2 Nf6 6. d3 Be6 7. d4 d5 8. exd5Nxd5 9. O-O Qf6 10. Bb5 O-O-O 11. Bxc6 bxc6 12. Nbd2 Bd6 13. Re1 Bf5 14. dxe5Bxe5 15. Bxe5 Qg6 16. Nd4 f6 17. Bg3 Bg4 18. f3 Bd7 19. Nc4 c5 20. Ne2 Rhe8 21.Qxd5 Qxc2 22. Qa8# 1-0"},{"date":"20230324","opponent":"billybobtherook","rating":781,"oppRating":871,"whiteOrBlack":"black","winLossDraw":"win","opening":"sicilian","accuracy":61.4,"oppAccuracy":62,"easilyPreventableLoss":false,"gotLucky":true,"numTurns":27,"numBlunders":3,"timeControl":"rapid15|10","remarks":"a short game against a higher rated player who missed a couple of opportunities to win, and resigned in the midgame after I achieved a good position. could have gone either way. rare instance of a victory in which I had a (slightly) lower accuracy score than the opponent!","moveList":"1. e4 c5 2. Nf3 Nc6 3. Nc3 e6 4. d3 d5 5. exd5 exd5 6. Be2 a6 7. O-O Bd6 8. Nxd5Nf6 9. Bg5 Be7 10. d4 Qxd5 11. Bxf6 Bxf6 12. c4 Qd6 13. d5 Ne5 14. b3 Nxf3+ 15.Bxf3 O-O 16. Qc2 Bd8 17. Qe4 Bc7 18. g3 Bh3 19. Rfe1 Rae8 20. Qh4 Qd7 21. Be4 g622. Bg2 Bg4 23. Rxe8 Rxe8 24. h3 Bf5 25. Rf1 Re2 26. Bf3 Rxa2 27. Bg4 Rb2 0-1"},{"date":"20230325","opponent":"the_shoe3","rating":791,"oppRating":758,"whiteOrBlack":"white","winLossDraw":"win","opening":"sicilian","accuracy":91.4,"oppAccuracy":67.5,"easilyPreventableLoss":false,"gotLucky":false,"numTurns":14,"timeControl":"rapid15|10","remarks":"My opponent took the bait in the center in the opening, even though my defenders outnumbered their attackers. At the end of the game, they fell for a checkmate trap. Could have gone either way if they had not bit on the center so early, or if they had recognized the checkmate threat at the end.","moveList":"1. e4 c5 2. Nf3 e5 3. Bc4 Nc6 4. c3 d6 5. d4 cxd4 6. cxd4 exd4 7. Nxd4 Nxd4 8.Qxd4 Nf6 9. Be2 d5 10. Nc3 dxe4 11. Bb5+ Bd7 12. Bg5 h6 13. Bxf6 Qxf6 14. Qxd7#1-0"},{"date":"20230325","opponent":"jasmine261","rating":806,"oppRating":781,"whiteOrBlack":"black","winLossDraw":"win","opening":"ponziani opening","accuracy":76.5,"oppAccuracy":66,"easilyPreventableLoss":false,"gotLucky":false,"numTurns":19,"timeControl":"rapid15|10","remarks":"good opening play allowed me to keep up the pressure, until they resigned after a hung rook","moveList":"1. e4 e5 2. Nf3 Nc6 3. c3 Nf6 4. d4 Nxe4 5. d5 Na5 6. Nxe5 Qe7 7. Bf4 g5 8. Bg3d6 9. Nf3 Nxg3+ 10. Be2 Nxh1 11. b4 Nc4 12. Kf1 Ng3+ 13. fxg3 Ne3+ 14. Kg1 Nxd115. Bxd1 Bg4 16. Nbd2 Bxf3 17. gxf3 Qe1+ 18. Nf1 Qxc3 19. a3 Qxa1 0-1"},{"date":"20230325","opponent":"raphaellinhares","rating":806,"oppRating":741,"whiteOrBlack":"white","winLossDraw":"loss","opening":"nimzowitsch defense","accuracy":55.4,"oppAccuracy":56.8,"easilyPreventableLoss":false,"gotLucky":false,"numTurns":69,"timeControl":"rapid15|10","remarks":"an unwise midgame exchange had me on the run until the endgame, when the opponent finally pushed a pawn that would have won, where I resigned","moveList":"1. d4 Nc6 2. e4 e6 3. Nf3 Nf6 4. Bg5 Be7 5. Bd3 h6 6. Bd2 g5 7. Ne5 Nxe5 8. dxe5Nh7 9. Nc3 f5 10. exf5 exf5 11. Bxf5 c6 12. Qh5+ Kf8 13. Qxh6+ Kf7 14. Qg6+ Kf815. Qh6+ Kf7 16. Ne4 d5 17. Nxg5+ Bxg5 18. Bxh7 Bxh6 19. Bxh6 Rxh7 20. Be3 Qe821. Bf4 Rh4 22. g3 Rg4 23. h3 Rg7 24. O-O-O c5 25. Rxd5 Be6 26. Rxc5 Rc8 27. Ra5Qc6 28. c3 Qxh1+ 29. Kc2 Qe4+ 30. Kc1 Qe1+ 31. Kc2 Rd8 32. Rxa7 Qxf2+ 33. Kc1Qxa7 34. b4 Qxa2 35. c4 Bxc4 36. h4 Qa5 37. bxa5 Rgg8 38. h5 Ra8 39. h6 Rh8 40.Kc2 Rxa5 41. Kc3 Be6 42. Kb4 Ra1 43. Kc5 Rc1+ 44. Kb6 Bc8 45. Kb5 Bd7+ 46. Kb6Bc8 47. Kb5 Kg6 48. Kb6 Kh5 49. e6 Re8 50. h7 Rxe6+ 51. Kb5 Bd7+ 52. Kb4 Rb6+53. Ka5 Ra6+ 54. Kb4 Ra4+ 55. Kb3 Rc8 56. Be5 Kg4 57. Kb2 Ra5 58. Bc3 Rh5 59.h8=Q Rcxh8 60. Bxh8 Rxh8 61. Kc3 Kxg3 62. Kb4 Rb8 63. Kc5 Bg4 64. Kb6 Bf3 65.Ka7 Re8 66. Kb6 Re6+ 67. Ka7 b6 68. Ka6 Be2+ 69. Ka7 b5 0-1"},{"date":"20230325","opponent":"Kisses47","rating":789,"oppRating":830,"whiteOrBlack":"black","winLossDraw":"loss","opening":"italian game","accuracy":58.6,"oppAccuracy":76,"easilyPreventableLoss":true,"gotLucky":false,"numTurns":19,"timeControl":"rapid15|10","remarks":"blundered a defense against a queen attack in the opening, leading to a poor position which I resigned from. I may have been able to play this one out.","moveList":"1. e4 e5 2. Nf3 Nc6 3. Bc4 Nf6 4. Ng5 d5 5. exd5 Nxd5 6. Nxf7 Qd7 7. Nxh8 Bc5 8.Bxd5 Qxd5 9. O-O b6 10. Qf3 Qd6 11. Qf7+ Kd8 12. Qg8+ Kd7 13. Qxg7+ Kd8 14. Nf7+Kd7 15. Nxd6+ Kxd6 16. Nc3 Ba6 17. Ne4+ Kd5 18. Re1 Bf8 19. Qf7+ 1-0"},{"date":"20230325","opponent":"Jacco1111","rating":791,"oppRating":884,"whiteOrBlack":"white","winLossDraw":"draw","opening":"slav defense","accuracy":69.2,"oppAccuracy":76.7,"easilyPreventableLoss":false,"gotLucky":false,"numTurns":34,"timeControl":"rapid15|10","remarks":"higher-rated opponent played well. I converted midgame gains into a draw, although I may have had a checkmate opportunity here to look in to for future similar situations.","moveList":"1. d4 d5 2. c4 c6 3. e3 Be6 4. b3 Nf6 5. Nd2 g6 6. Ngf3 Bg7 7. Ne5 O-O 8. Bd3Qc7 9. O-O Na6 10. a3 Bh6 11. Bb2 Nb8 12. a4 Nbd7 13. Ndf3 Nxe5 14. dxe5 Ne4 15.Re1 Nc5 16. Bxg6 hxg6 17. b4 Ne4 18. Nh4 dxc4 19. Qd4 Bd5 20. f3 c3 21. Bxc3Nxc3 22. Qxc3 Bg7 23. e4 Bxe5 24. Qc5 Bxa1 25. b5 b6 26. Qc2 Bd4+ 27. Kh1 Be628. e5 c5 29. Nxg6 fxg6 30. Qxg6+ Kh8 31. Qh6+ Kg8 32. Qg6+ Kh8 33. Qh6+ Kg8 34.Qg6+ 1/2-1/2"},{"date":"20230325","opponent":"Ruthviklalithya","rating":801,"oppRating":891,"whiteOrBlack":"black","winLossDraw":"win","opening":"scotch game","accuracy":51.7,"oppAccuracy":48.7,"easilyPreventableLoss":false,"gotLucky":true,"numTurns":35,"timeControl":"rapid15|10","remarks":"an interesting game. an early queen attack by the opponent was foiled, giving me a midgame advantage which I squandered with a questionable rook sacrifice in a premature attempt to checkmate. although the opponent had me after that, they blundered into the very checkmate a couple turns later. lucky win against a tough opponent.","moveList":"1. e4 e5 2. Nf3 Nc6 3. d4 f5 4. Bg5 Nf6 5. Bxf6 gxf6 6. dxe5 fxe4 7. Nd4 fxe5 8.Nxc6 bxc6 9. Qh5+ Ke7 10. Qxe5+ Kf7 11. Qxh8 Bb4+ 12. c3 Qxh8 13. Bc4+ d5 14.Be2 Bxc3+ 15. Nd2 Bxb2 16. Rb1 Bc3 17. Rc1 d4 18. Rd1 e3 19. fxe3 dxe3 20. O-O+Ke7 21. Nc4 Ba6 22. Rf3 Bd2 23. Nxd2 Bxe2 24. Rxe3+ Kd7 25. Rxe2 Qg8 26. Ne4+Kc8 27. Nf6 Qg6 28. Nxh7 Rb8 29. Nf8 Qf7 30. Ne6 Qe7 31. Nf4 Qc5+ 32. Kh1 Rb133. Rxb1 Qf5 34. Rf1 c5 35. Ne6 Qxf1# 0-1"}]